taskt/Core/Automation/Commands/ExcelGroup/IExcelColumnRangeProperties.puml
@startuml
left to right direction
package "taskt.Core.Automation.Commands"{
Interface "IExcelColumnRangeProperties" {
+{abstract} v_ColumnIndex : String <<get>> <<set>> <<abstract>> 
+{abstract} v_RowStart : String <<get>> <<set>> <<abstract>> 
+{abstract} v_RowEnd : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExcelRCRangeProperties" {
+{abstract} v_ColumnType : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExcelInstanceProperties" {
+{abstract} v_InstanceName : String <<get>> <<set>> <<abstract>> 
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExcelRCValueTypeProperties" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExpandableProperties" {
}
}

package "taskt.Core.Automation.Commands"{
Interface "IExcelValueTypeProperties" {
+{abstract} v_ValueType : String <<get>> <<set>> <<abstract>> 
}
}

taskt.Core.Automation.Commands.IExcelColumnRangeProperties --|> taskt.Core.Automation.Commands.IExcelRCRangeProperties
taskt.Core.Automation.Commands.IExcelRCRangeProperties --|> taskt.Core.Automation.Commands.IExcelInstanceProperties
taskt.Core.Automation.Commands.IExcelRCRangeProperties --|> taskt.Core.Automation.Commands.IExcelRCValueTypeProperties
taskt.Core.Automation.Commands.IExcelInstanceProperties --|> taskt.Core.Automation.Commands.IExpandableProperties
taskt.Core.Automation.Commands.IExcelRCValueTypeProperties --|> taskt.Core.Automation.Commands.IExcelValueTypeProperties
taskt.Core.Automation.Commands.IExcelValueTypeProperties --|> taskt.Core.Automation.Commands.IExpandableProperties
@enduml
